In [1]:
import pandas as pd
df = pd.DataFrame({'col1':[1,2,3,4],'col2':[444,555,666,444],'col3':['abc','def','ghi','xyz']})
df.head()

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

to retun unique values in a columns

it returns an arrary

In [3]:
df['col2'].unique()

array([444, 555, 666])

to retuns the number of uniques value in a columns

In [4]:
df['col2'].nunique()

3

count of each unique values

In [7]:
df['col2'].value_counts()

444    2
555    1
666    1
Name: col2, dtype: int64

# Conditonal Selection

In [9]:
df[df['col2']>500]

   col1  col2 col3
1     2   555  def
2     3   666  ghi

In [10]:
def times(x):
    return x**2
times(5)

25

In [12]:
df['col1'].sum()

10

# apply() function pandas



we can also apply user defined function

In [21]:
def times2(x):
    return x**2

In [23]:
df['col1'].apply(times2)

0     1
1     4
2     9
3    16
Name: col1, dtype: int64

using lambda instead of def and apply together

In [28]:
df['col2'].apply(lambda x:x*2)

# here each values in column2 is assigned to lambda arg x and then find the 2 times of each values 
# since x**2 is the expression

0     888
1    1110
2    1332
3     888
Name: col2, dtype: int64

In [29]:
df['col1'].apply(lambda y:y*4)

0     4
1     8
2    12
3    16
Name: col1, dtype: int64

# removing columns

In [30]:
df.drop(axis=1,labels='col2')

   col1 col3
0     1  abc
1     2  def
2     3  ghi
3     4  xyz

In [31]:
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

# to get the column names

In [32]:
df.columns

Index(['col1', 'col2', 'col3'], dtype='object')

sort by column name 'col2'

# sorting

sort by columns

In [34]:
df.sort_values('col2')

   col1  col2 col3
0     1   444  abc
3     4   444  xyz
1     2   555  def
2     3   666  ghi

In [38]:
df.sort_values('col1',ascending=False)

# here v ssort in descendingn order

   col1  col2 col3
3     4   444  xyz
2     3   666  ghi
1     2   555  def
0     1   444  abc

In [45]:
df.sort_values(by='col1')

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

sort by index

In [47]:
df.sort_index(axis=1,ascending=False)

  col3  col2  col1
0  abc   444     1
1  def   555     2
2  ghi   666     3
3  xyz   444     4

# checking whether there is null values in dataframe

In [49]:
df.isna()

    col1   col2   col3
0  False  False  False
1  False  False  False
2  False  False  False
3  False  False  False

In [50]:
df.isnull()

    col1   col2   col3
0  False  False  False
1  False  False  False
2  False  False  False
3  False  False  False

# pivot table

Create a spreadsheet-style pivot table as a DataFrame. The levels in
the pivot table will be stored in MultiIndex objects (hierarchical
indexes) on the index and columns of the result DataFrame.

In [52]:
data = {'A':['foo','foo','foo','bar','bar','bar'],
     'B':['one','one','two','two','one','one'],
       'C':['x','y','x','y','x','y'],
       'D':[1,3,2,5,4,1]}

df = pd.DataFrame(data)

In [53]:
df

     A    B  C  D
0  foo  one  x  1
1  foo  one  y  3
2  foo  two  x  2
3  bar  two  y  5
4  bar  one  x  4
5  bar  one  y  1

In [66]:
import numpy as np
table=df.pivot_table(index=['A',"B"],values='D',columns=['C'])
table

C          x    y
A   B
bar one  4.0  1.0
    two  NaN  5.0
foo one  1.0  3.0
    two  2.0  NaN

checnking null values in dataframe

In [67]:
table.isna()

C            x      y
A   B
bar one  False  False
    two   True  False
foo one  False  False
    two  False   True

# EXERCISES

In [68]:
table.loc['bar']

C      x    y
B
one  4.0  1.0
two  NaN  5.0

In [69]:
table.loc['foo']

C      x    y
B
one  1.0  3.0
two  2.0  NaN

In [75]:
table.xs('bar')

C      x    y
B
one  4.0  1.0
two  NaN  5.0

In [76]:
table.xs('foo')

C      x    y
B
one  1.0  3.0
two  2.0  NaN

In [78]:
table.xs(('foo','one'))

C
x    1.0
y    3.0
Name: (foo, one), dtype: float64

In [79]:
table.xs(('bar','two'))

C
x    NaN
y    5.0
Name: (bar, two), dtype: float64

In [84]:
table.xs(key='one',level='B')

C      x    y
A
bar  4.0  1.0
foo  1.0  3.0

In [87]:
table.xs(key='two',level='B')

C      x    y
A
bar  NaN  5.0
foo  2.0  NaN